[
    {
        "title": "Inala Capital Limited Share Repurchase",
        "date": "25 October 2024",
        "content": "Notice to shareholders of Inala Capital Limited concerning the invitation to qualifying shareholders to tender for a share repurchase of all or a portion of their shares in terms of the approved share repurchase programme. As a shareholder who holds less than 100,000 ordinary shares in Inala on this 25 day of October 2024, kindly be informed that you are eligible to voluntarily participate in a share repurchase programme of all or a portion of your shares at a price of E1.20 per share. Please note that participation in this programme is entirely voluntary. If you are in any doubt as to what action you should take in terms of this notice, you should consult your broker, banker, legal advisor, accountant or other professional advisor immediately. View or download here.",
        "image": "static/images/inala.jpg"
    },
    {
        "title": "Nkonyeni Pre-Cast Limited NPC102 Bond",
        "date": "24 October 2024",
        "content": "Nkonyeni Pre-cast Limited (NPC) launch of 10 million Emalangeni bond at prime plus 1%, maturing 5 December 2029, interest payment will be 30 September of each year until Maturity. Minimum investment is E5 000. Application form can be downloaded below. The Bond will be issued using the competitive multiple bid auction model and is open to the public including individuals, corporate and institutional investors. All investors should apply through the Transfer Secretary SNG Grant Thornton Eswatini. Email: Transfersecretary@sng.gt.com. View or download here.",
        "image": "static/images/npc.jpg"
    },
    {
        "title": "Inala Capital Reviewed Financial Results",
        "date": "21 October 2024",
        "content": "Inala Capital Limited reviewed financial results for the 6 months ended 30 June 2024. View or download here.",
        "image": "static/images/inala.jpg"
    },
    {
        "title": "Greystone Partners Limited Reviewed Financial Results",
        "date": "21 October 2024",
        "content": "Greystone Partners Limited reviewed financial results for the 6 months ended 30 June 2024. View or download here.",
        "image": "static/images/grey.jpg"
    },
    {
        "title": "First National Bank of Eswatini Limited Notice of Annual General Meeting",
        "date": "24 October 2024",
        "content": "Notice is hereby given that an Annual General Meeting (AGM) of First National Bank of Eswatini Limited for the year ended 30 June 2024 will be held at FNB Head Office, Ezulwini at 12:00 noon on 01 November 2024. View or download here.",
        "image": "static/images/fnb.jpg"
    },
    {
        "title": "Eswatini Stock Exchange Press Release on NPC Share Certificates",
        "date": "14 October 2024",
        "content": "Notice to NPC Shareholders - Nkonyeni Precast Limited listed in a dematerialised environment, its share certificates have been converted from physical form into electronic records held within a secure digital registry managed by a Central Securities Depository. No physical share certificates were issued to NPC shareholders since Nkonyeni Precast Limited was listed in a dematerialised environment as per Legal Notice No. 269 of 2022 issued by the Ministry of Finance. View or download here.",
        "image": "static/images/npc.jpg"
    },
    {
        "title": "Swazi Empowerment Limited Notice of Annual General Meeting",
        "date": "10 October 2024",
        "content": "Notice is hereby given that an Annual General Meeting (AGM) of Swazi Empowerment Limited for shareholders will be held at Royal Villas Hotel, Ezulwini at 11:00 am on 25 October 2024. View or download here.",
        "image": "static/images/swap.jpg"
    },
    {
        "title": "First National Bank Limited Dividend Declared",
        "date": "09 October 2024",
        "content": "Notice is hereby given that the Directors of First National Bank of Eswatini declared a final gross cash ordinary dividend of 71.21 cents per ordinary share, totalling E94,710,658, out of the income reserves for the year ended 30 June 2024. View or download here.",
        "image": "static/images/fnb.jpg"
    },
    {
        "title": "Nedbank Limited Reviewed Financial Results",
        "date": "28 September 2024",
        "content": "Nedbank Eswatini Limited Interim Financial Results for the 6 months period ended 30 June 2024. View or download here.",
        "image": "static/images/ned.jpg"
    },
    {
        "title": "Nkonyeni Pre-Cast Limited Notice of 8th Annual General Meeting",
        "date": "24 September 2024",
        "content": "Nkonyeni Precast Limited Shareholders are notified of the Eight Annual General Meeting to be held on Thursday 17 October 2024, at the Nkonyeni Precast offices in Sidvokodvo/and via Microsoft Teams at 9:00am. View or download here.",
        "image": "static/images/npc.jpg"
    },
    {
        "title": "Royal Eswatini Sugar Corporation Limited Interim Dividend Declared",
        "date": "20 September 2024",
        "content": "Royal Eswatini Sugar Corporation Shareholders - Notice is hereby given that an interim dividend (dividend 65) of 129.20 cents per share in the currency of Eswatini for the year to 31 March 2025 has been declared payable to Shareholders registered in the books of the company at the close of business on 25 October 2024. View or download here.",
        "image": "static/images/res.jpg"
    },
    {
        "title": "SBC Limited Interim Dividend Declared",
        "date": "18 September 2024",
        "content": "Notice is hereby given to shareholders of SBC Limited that a cash dividend of E10 million (10 cents per share) has been declared by the Company to ordinary shareholders registered as such in the Company's share register at the close of business on Friday, 04 October 2024. View or download here.",
        "image": "static/images/sbc.jpg"
    }
]